Repository: unfrl/dug
Catalog: cli/i18n/dug.*.resx
Languages: de, es

source: Default
de: Standard
es: Defecto

# ER_Specified_File_Not_Found
source: Specified file does not exist: {0}
de: Die angegebene Datei nicht vorhanden ist: {0}
es: El archivo especificado no existe: {0}

# ER_File_Not_Found
source: Unable to find file at: {0}
de: Kann Datei zu finden unter: {0}
es: No se ha podido encontrar el archivo en: {0}

# ER_Hostname_Missing
source: A {0} must be provided. (run dug help or dug --help for more info)
de: A {0} muss zur Verfügung gestellt werden. (Run dug Hilfe oder dug --help für weitere Informationen)
es: A {0} debe ser proporcionada. (Cavado ayuda de ejecución o excavados --help para obtener más información)

# ER_Must_Be_Between_0_1
source: must be between o and 1
de: muss zwischen o und 1
es: debe estar entre O y 1

# ER_Run_Data_Columns_Without_Server_File
source: --data-columns cannot be used without specifying a server file (-f)
de: --data-columns können nicht ohne die Angabe einer Server-Datei verwendet werden (-f)
es: --data-columns no se pueden utilizar sin especificar un archivo de servidor (f)

# ER_Run_Data_Headers_Present_Requires_Data_Columns
source: --data-headers-present cannot be used without (--data-columns)
de: --data-headers-present nicht ohne verwendet werden (--data-columns)
es: --data-headers-present no se puede utilizar sin (--data-columns)

# ER_Run_Data_Separator_Requires_Data_Columns
source: --data-separator cannot be used without (--data-columns)
de: --data separator kann nicht verwendet werden, ohne (--data-columns)
es: --data-separator no puede utilizarse sin (--data-columns)

# ER_Run_Inavlid_Continent
source: Invalid Continent value:
de: Ungültige Kontinent Wert:
es: Continente valor no válido:

# ER_Run_Invalid_Query_Type
source: Invalid Query Type value:
de: Ungültige Abfragetyp Wert:
es: Tipo de consulta no válido valor:

# ER_Run_Output_Format_Requires_Template
source: A template (--output-template) is required when using an output-format other than the default
de: Eine Vorlage (--output-template) erforderlich ist, wenn ein Ausgabeformat anders als der Standard Verwendung
es: Una plantilla (--output-template) se requiere cuando se utiliza una salida en formato distinto del predeterminado

# ER_Run_Server_Parse
source: Unable to parse provided Server:
de: Unfähig bereitgestellt Server zu analysieren:
es: No se puede analizar proporcionado Servidor:

# ER_Run_Table_Detail_Out_Of_Range
source: The specified table-detail is out of range. Valid values are in the range [1-2]
de: Das angegebene Tabelle-Detail ist außerhalb des Bereichs. Gültige Werte sind im Bereich [1-2]
es: La mesa de detalle especificado está fuera de rango. Los valores válidos están en el intervalo [1-2]

# ER_Run_Unable_Parse_Data_Column_Header
source: Unable to parse provided column header:
de: Kann nicht Parse bereitgestellt Spaltenkopf:
es: No se puede analizar proporcionado encabezado de la columna:

# ER_Run_Unable_Parse_Template_Header
source: Unable to parse provided output-template header:
de: Kann nicht Parse bereitgestellt Ausgabe-Template-Header:
es: No se puede analizar proporcionado cabecera de salida-plantilla:

# ER_Unable_Render_Results_In_Format
source: Unable to render results in specified format {0}
de: Unfähig Ergebnisse in bestimmtem Format zu machen {0}
es: No se puede representar los resultados en formato especificado {0}

# ER_Unable_Resolve_Header
source: Unable to determine how to resolve specified header: {0}
de: Nicht in der Lage zu bestimmen, wie angegebene Header zu beheben: {0}
es: No se puede determinar cómo resolver encabezado especificado: {0}

# ER_Unable_Set_Field_X_To_Value_X
source: Unable to set field {0} to provided value: {1}. This might be a header trying to be parsed as a value, try adding --data-headers-present
de: Kann set Feld {0} bereitgestellt Wert: {1}. Dies könnte ein Header, die versuchen, als ein Wert analysiert werden, versuchen Sie, --data-headers-present
es: Incapaz de campo conjunto {0} al valor proporcionado: {1}. Esto podría ser una cabecera tratando de ser analizada como un valor, trate de añadir --data-headers-present

# ER_Unable_To_Get_Value_From_Header_X_Expected_At_Index_X
source: Unable to retrieve expected value from specified header: {0}. Expected to be at index {1}
de: Unfähig Erwartungswert von bestimmten Header abzurufen: {0}. Erwartete im Index {1}
es: No se puede recuperar el valor esperado de encabezado especificado: {0}. Se espera que sea en el índice {1}

# ER_Unable_To_Parse_File
source: Unable to parse content from specified file: {0} Consider using --data-columns
de: Können Parse-Gehalt von angegebener Datei: {0} Erwägen Sie die Verwendung --data-columns
es: Incapaz de contenido de análisis de archivo especificado: {0} Considere el uso de --data-columns

# ER_Update_Data_Headers_Present_Requires_Data_Columns
source: --data-headers-present cannot be used without (--data-columns)
de: --data-headers-present nicht ohne verwendet werden (--data-columns)
es: --data-headers-present no se puede utilizar sin (--data-columns)

# ER_Update_Data_Separator_Requires_Data_Columns
source: --data-separator cannot be used without (--data-columns)
de: --data-separator kann nicht verwendet werden, ohne (--data-columns)
es: --data-separator no puede utilizarse sin (--data-columns)

# ER_Update_Reliability_Only_Requires_Reliability
source: --reliability-only cannot be used without (-r,--reliability)
de: --reliability-only kann nicht verwendet werden, ohne (-r, -reliability)
es: --reliability sólo no se pueden utilizar sin (-r, - reliability)

# ER_Update_Server_Parse
source: Unable to parse provided Server:
de: Unfähig bereitgestellt Server zu analysieren:
es: No se puede analizar proporcionado Servidor:

# ER_Update_Unable_Parse_Data_Column_Header
source: Unable to parse provided column header:
de: Kann nicht Parse bereitgestellt Spaltenkopf:
es: No se puede analizar proporcionado encabezado de la columna:

# ER_Update_Unable_Parse_Update_URL
source: Unable to parse specified --update-url
de: Unfähig angegeben --update-url zu analysieren
es: No se puede analizar especificada --update-url

# ER_Update_Update_URL_Requires_Data_Columns
source: --data-columns must be specified when using a custom update URL (--update-url)
de: --data-columns müssen angegeben werden, wenn eine benutzerdefinierte Update-URL (--update-url) unter Verwendung von
es: --data-columns deben especificarse cuando se utiliza una URL de actualización personalizada (--update-url)

# ER_Update_Update_URL_Requires_File_Or_Servers
source: --update-url cannot be used with (-f) or (-s)
de: --update-url kann nicht verwendet werden (-f) oder (-s)
es: --update-url no se puede utilizar con (-f) o (-s)

# EX_Import_And_Overwrite_Servers
source: Import and overwrite servers
de: Import und Überschreiben-Server
es: Importación y servidores de sobreescritura

# EX_Import_Servers
source: Import servers
es: servidores de importación

# EX_Json_Fields_Output
source: Output specific fields of results as json
de: Output bestimmte Bereiche der Ergebnisse als json
es: campos específicos de salida de resultados como JSON

# EX_Overwrite
source: Overwrite current servers
de: Überschreiben aktuelle Server
es: servidores actuales de sobreescritura

# EX_Query_Reliable_On_Continents
source: Query the top 3 most reliable servers in Africa and North America as well as 8.8.8.8
de: Abfrage der Top-3 zuverlässigsten Server in Afrika und Nordamerika sowie 8.8.8.8
es: Consulta de los 3 mejores servidores más confiables en África y América del Norte, así como 8.8.8.8

# EX_Remote_Import_And_Update
source: Import servers from remote source, then update all servers' reliability
de: Import-Server von entfernten Quelle, dann ist alle Zuverlässigkeit des Servers aktualisieren
es: servidores de importación de origen remoto, a continuación, actualizar todos los servidores fiabilidad

# EX_Remote_Import_And_Update_Prune
source: Import servers from remote source, then update all servers' reliability. Remove servers that fail
de: Import-Server von entfernten Quelle, dann ist alle Zuverlässigkeit des Servers aktualisieren. Entfernen von Servern, die fehlschlagen
es: servidores de importación desde la fuente remota, a continuación, actualizar todos los servidores fiabilidad. Quitar los servidores que no

# EX_Specify_Continents
source: Specify continents to query on
de: Geben Kontinente abfragen auf
es: Especificar continentes para consultar en

# EX_Specify_Query_Types
source: Specify query type(s)
de: Geben Sie den oder die Abfragetypen an
es: Especificar tipo de consulta(s)

# EX_Update_Reliability_Prune_2_Retries
source: Update server reliability, remove any that fail. Also use up to 2 retries when querying each server
de: Update-Server Zuverlässigkeit, entfernen Sie alle, fehlschlagen. Verwenden Sie auch bis zu 2 Wiederholungen bei dem jeder Server abfragt
es: Actualización de confiabilidad del servidor, elimine las que fallan. También utilizar hasta 2 reintentos cuando se consulta cada servidor

# HT_Enable_Verbose_Output
source: Enable Verbose Output
de: Aktivieren Sie die ausführliche Ausgabe
es: Habilitar Salida detallada

# HT_Parallel
source: The number of servers to perform queries against in parallel
de: Die Anzahl der Server-Abfragen parallel auszuführen
es: El número de servidores para realizar consultas en forma paralela

# HT_Retries
source: The number of times to retry queries on servers that error (or timeout)
de: Die Anzahl der zu Wiederholungs Abfragen auf Servern, die Fehler (oder Timeout)
es: El número de veces de reintento a consultas en los servidores de ese error (o tiempo de espera)

# HT_Run
source: Get DNS propagation info for a URL
de: Erhalten DNS Propagation info für eine URL
es: Obtener información propagación de DNS para una dirección URL

# HT_Run_Continents
source: The continents on which servers will be queried. Defaults to all.
de: Die Kontinente, auf dem Server abgefragt werden. Defaults für alle.
es: Los continentes en los que se consulta a los servidores. El valor predeterminado es todo.

# HT_Run_Custom_Server_File
source: Use the specified DNS server list for this run.
de: Verwenden Sie die angegebene DNS-Serverliste für diesen Lauf.
es: Utilice la lista de servidores DNS especificado para esta ejecución.

# HT_Run_Data_Columns
source: Specify the fields, and their order, in the file specified with (-f). Must be used with (-f). Options: ipaddress,countrycode,city,dnssec,reliability,ignore
de: Geben Sie die Felder und ihre Reihenfolge, in der Datei mit (-f) angegeben. Muss mit (-f) verwendet werden. Optionen: ipaddress,countrycode,city,dnssec,reliability,ignore
es: Especificar los campos, y su orden, en el archivo especificado con (-f). Se debe utilizar con (-f). Opciones: direcciónip, código del país, ciudad, dnssec, fiabilidad, ignoran

# HT_Run_Data_Headers_Present
source: Specifies whether or not headers are present in the file specified with (-f). Can only be used in conjunction with --data-columns
de: Gibt an, ob nicht-Header sind in der Datei mit (-f) angegeben. Nur in Verbindung mit --data-columns verwendet werden
es: Especifica si las cabeceras están presentes en el archivo especificado con (-f). Sólo se puede usar en conjunción con --data-columns

# HT_Run_Data_Separator
source: Specifies the separator to be used when parsing servers from the file specified with (-f). Can only be used in conjunction with --data-columns. Assumes ',' if not set.
de: Gibt den Separator verwendet werden soll, wenn Server aus der Datei angegeben mit (-f) Parsen. Nur in Verbindung mit --data-columns verwendet werden. wenn nicht gesetzt Geht davon aus ','.
es: Especifica el separador que se utilizará cuando se analizan los servidores desde el archivo especificado con (-f). Sólo se puede usar en conjunción con --data-columns. Asume ',' si no se establece.

# HT_Run_Hostname
source: The Hostname you would like to see propagation for.
de: Der Hostname möchten Sie Ausbreitung sehen für.
es: El nombre de host que le gustaría ver que la propagación de.

# HT_Run_Multiple_Server_Sources
source: When specifying servers (-s, --servers) or (-f, --file) also use integrated servers
de: Bei der Angabe von Servern (-s, --servers) oder (-f, --file) verwendet auch integrierte Server
es: Al especificar los servidores (-s, --servers) o (-f, --file) también utilizan servidores integrados

# HT_Run_Output_Format
source: Specify the output format. For formats other than the default you must also specify a template (--output-template). Options: CSV,JSON
de: Geben Sie das Ausgabeformat. Für andere Formate als der Standard Sie auch eine Vorlage (--output-template) angeben müssen. Optionen: CSV, JSON
es: Especificar el formato de salida. Para formatos que no sean por defecto también debe especificar una plantilla (--output-template). Opciones: CSV, JSON

# HT_Run_Query_Types
source: The query type(s) to run against each server. Specify a single value (A) or multiple separated by commas (A,MX).
de: Der oder die Abfragetypen, die für jeden Server ausgeführt werden sollen. Geben Sie einen einzelnen Wert (A) oder mehrere durch Kommas getrennte Werte (A, MX) an.
es: El tipo de consulta(s) para ejecutar el uno contra el servidor. Especificar un solo valor (A) o múltiples separados por comas (A, MX).

# HT_Run_Servers
source: The servers to query against instead of the integrated servers. Specify a single value ("8.8.8.8") or multiple separated by commas ("8.8.8.8","2001:4860:4860::8888").
de: Die Server abzufragen gegen anstelle der integrierten Server. Geben Sie einen einzelnen Wert ( "8.8.8.8") oder mehr durch Komma getrennt ( "8.8.8.8", "2001: 4860: 4860 :: 8888").
es: Los servidores de consulta en lugar de los servidores integrados. Especificar un único valor ( "8.8.8.8") o múltiples separados por comas ( "8.8.8.8", "2001: 4860: 4860 :: 8888").

# HT_Run_Server_Count
source: dug runs queries against the top servers, ranked by reliability, per continent. This allows you to set how many servers from each continent to use.
de: dug führt Abfragen gegen den Top-Server, durch Zuverlässigkeit Platz, pro Kontinent. Auf diese Weise können Sie festlegen, wie viele Server von jedem Kontinent zu verwenden.
es: dug ejecuta consultas contra los servidores principales, calificadas por la fiabilidad, por continente. Esto le permite ajustar el número de servidores de cada continente para su uso.

# HT_Run_Table_Detail_Level
source: Specify the level of detail to show when rendering tables. Ignored if output-format is set to anything other than its default (TABLES)
de: Geben Sie den Detailgrad zu zeigen, wenn Tabellen-Rendering. Wird ignoriert, wenn output-format auf etwas anderes als die Standard gesetzt (TABLES)
es: Especificar el nivel de detalle para mostrar al representar tablas. Ignora si la --output-format se establece en otra cosa que no sea su valor por defecto (TABLES)

# HT_Run_Template
source: Specify which data, and in what order, to put into out. Ignored if --output-format=TABLES. Options: ipaddress,countrycode,city,dnssec,reliability,continentcode,countryname,countryflag,citycountryname,citycountrycontinentname,responsetime,recordtype,haserror,errormessage,errorcode,value
de: Angeben, welche Daten in welcher Reihenfolge, in heraus zu setzen. Wird ignoriert, wenn --output-format = TABLES. Optionen: ipaddress,countrycode,city,dnssec,reliability,continentcode,countryname,countryflag,citycountryname,citycountrycontinentname,responsetime,recordtype,haserror,errormessage,errorcode,value
es: Especificar los datos, y en qué orden, para poner en salir. Se ignora si --output-format=TABLES. Opciones: ipaddress,countrycode,city,dnssec,reliability,continentcode,countryname,countryflag,citycountryname,citycountrycontinentname,responsetime,recordtype,haserror,errormessage,errorcode,value

# HT_Timeout
source: The timeout (in ms) to be used when querying each DNS Server
de: Die Timeout (in ms) verwendet werden, wenn jeder DNS-Server abfragt
es: El tiempo de espera (en ms) que se utilizará cuando se consulta cada servidor DNS

# HT_Update
source: Update DNS server list with any new unique servers. Uses remote server to get list by default.
de: Update DNS-Server-Liste mit allen neuen einzigartigen Servern. Verwendet Remote-Server-Liste standardmäßig zu bekommen.
es: Actualizar lista de servidores DNS con los nuevos servidores únicos. Utiliza servidor remoto para obtener la lista por defecto.

# HT_Update_Custom_Server_File
source: Update DNS server list using the specified file instead of the remote source
de: Update DNS-Liste Server die angegebene Datei anstelle der Fernquelle
es: Actualizar lista de servidores DNS que utiliza el archivo especificado en lugar de la fuente remota

# HT_Update_Data_Columns
source: Specify the fields, and their order, of the data being imported. Applies to data imported from a file (-f) or remotely (--update-url). Use individually or specify multiple fields separated by commas. Options: ipaddress,countrycode,city,dnssec,reliability,ignore
de: die Felder angeben, und deren Reihenfolge, der Daten importiert werden. Gilt für Daten aus einer Datei importiert (-f) oder remote (--update-url). Verwenden Sie einzeln oder geben Sie mehrere durch Kommata getrennte Felder. Optionen: ipaddress,countrycode,city,dnssec,reliability,ignore
es: Especificar los campos, y su orden, de los datos que se importa. Se aplica a los datos importados de un archivo (-f) o remota (--update-url). Utilizar de forma individual o especificar varios campos separados por comas. Opciones: ipaddress,countrycode,city,dnssec,reliability,ignore

# HT_Update_Data_Headers_Present
source: Specifies whether or not headers are present on the data being imported. Can only be used in conjunction with --data-columns
de: Gibt an, ob nicht Header sind auf den Daten importiert werden. Nur in Verbindung mit --data-columns verwendet werden
es: Especifica si las cabeceras están presentes en los datos importados. Sólo se puede usar en conjunción con --data-columns

# HT_Update_Data_Separator
source: Specifies the separator to be used when parsing import data. Can only be used in conjunction with --data-columns. Assumes ',' if not set.
de: Gibt den Separator verwendet werden soll, wenn das Parsen Importdaten. Nur in Verbindung mit --data-columns verwendet werden. wenn nicht gesetzt Geht davon aus ','.
es: Especifica el separador que se utilizará cuando se analizan los datos de importación. Sólo se puede usar en conjunción con --data-columns. Asume ',' si no se establece.

# HT_Update_Overwrite
source: Overwrite the current server list instead of updating it.
de: Überschreiben Sie die aktuelle Serverliste, anstatt sie zu aktualisieren.
es: Sobrescribir la lista de servidores actual en lugar de su actualización.

# HT_Update_Reliability
source: Runs a query for a very stable domain (google.com) against ALL servers. Can be set to 'normal' or 'prune'. Normal updates server reliability based on the results, Prune removes servers that failed (timeout, error, etc)
de: Führt eine Abfrage für eine sehr stabile Domain (google.com) für ALLE Server aus. Kann auf "normal" oder "prune" eingestellt werden. Normalen Aktualisierungen der Serverzuverlässigkeit basierend auf den Ergebnissen entfernt Prune Server, die ausgefallen sind (Zeitüberschreitung, Fehler usw.).
es: Se ejecuta una consulta para un dominio muy estable (google.com) en contra de todos los servidores. Se puede establecer en 'normal' o 'prune'. actualizaciones normales fiabilidad del servidor basado en los resultados, ciruela pasa elimina los servidores que han fallado (tiempo de espera, errores, etc.)

# HT_Update_Reliability_Only
source: Can only be used with the (-r,--reliability) option. This will keep any new servers from other options (-s,-f,etc) or remote sources from being added. Use if you only want to update the reliability of the currently present servers
de: Cann nur mit der (-r, --reliability) verwendet werden. Dies hält alle neue Server von anderen Optionen (-s, -f, usw.) oder entfernten Quellen aus hinzugefügt werden. Verwenden Sie, wenn Sie nur die Zuverlässigkeit der aktuell vorhandenen Server aktualisieren möchten
es: Sólo se puede utilizar con el (, -r --reliability) opción. Esto evitará que los nuevos servidores de otras opciones (-s, -f, etc.) o fuentes remotas se agreguen. Utilizar si sólo desea actualizar la fiabilidad de los servidores actualmente presentes

# HT_Update_Servers
source: The server IPs to import instead of the remote source. Specify a single value ("8.8.8.8") or multiple separated by commas ("8.8.8.8","2001:4860:4860::8888").
de: Die Server-IP-Adressen anstelle der entfernten Quelle zu importieren. Geben Sie einen einzelnen Wert ( "8.8.8.8") oder mehr durch Komma getrennt ( "8.8.8.8", "2001: 4860: 4860 :: 8888").
es: Las IP del servidor importar en lugar de la fuente remota. Especificar un único valor ( "8.8.8.8") o múltiples separados por comas ( "8.8.8.8", "2001: 4860: 4860 :: 8888").

# HT_Update_Update_URL
source: Specifies the remote URL to use to retrieve servers. To use this you must also set --data-columns so the servers can be deserialized
de: Gibt die Remote-URL zu verwenden, um Server abzurufen. Um dies zu verwenden, müssen Sie auch --data-columns gesetzt, so kann der Server deserialisiert wird
es: Especifica la URL remoto para utilizar para recuperar servidores. Para utilizar esta también debe establecer --data-columns por lo que los servidores se pueden deserializan

# Output_Added_X_Servers
source: Added {0} DNS Servers.
de: Hinzugefügt {0} DNS-Server.
es: Añadido {0} servidores DNS.

# Output_Added_X_Servers_From_X
source: Added {0} DNS Servers from {1}
de: Hinzugefügt {0} DNS-Server von {1}
es: Añadido {0} servidores DNS desde {1}

# Output_Added_X_Servers_Provided_Already_Present
source: Added {0} DNS Servers. The provided server(s) are already present.
de: Hinzugefügt {0} DNS-Server. Die zur Verfügung gestellten Server (n) sind bereits vorhanden.
es: Añadido {0} servidores DNS. El servidor(s) proporcionado ya están presentes.

# Output_Animation_Disabled
source: Progress Animation disabled during verbose output
de: Progress Animation während ausführliche Ausgabe deaktiviert
es: El progreso de Animación desactiva durante la salida detallada

# Output_Connection_Timeout
source: Connection Timeout
de: Verbindungszeitüberschreitung
es: El tiempo de conexión expiro

# Output_Finish_Query
source: FINISH -- {0} {1} -- {2}ms
es: ACABADO - {0} {1} - {2} ms

# Output_Loaded_X_Servers_From_Included_Source
source: Loaded {0} DNS Servers from built-in source
de: Geladen {0} DNS-Server von Einbau-Quelle
es: Cargadas {0} servidores DNS de una función de fuente

# Output_Loaded_X_Servers_From_X
source: Loaded {0} DNS Servers from {1}
de: Geladen {0} DNS-Server von {1}
es: Cargadas {0} servidores DNS desde {1}

# Output_Overwritting_X_With_X_Specified_Servers
source: Overwriting {0} with {1} specified servers
de: Überschreiben {0} mit {1} angegebenen Servern
es: Sobrescribiendo {0} {1} con servidores especificados

# Output_Pruning_Because_Failed
source: PRUNING -- {0} {1} due to failed response
de: PRUNING - {0} {1} aufgrund fehlerhafter Antwort
es: PODA - {0} {1} debido a la respuesta fallida

# Output_Retrieved_X_Servers_From_Remote_X
source: Retrieved {0} novel DNS Servers from {1}
de: Abgerufen {0} neuer DNS-Server von {1}
es: Obtenido {0} nuevos servidores DNS desde {1}

# Output_Servers_To_Use
source: Server Count: {0}
de: Server-Zähler: {0}
es: Conde servidor: {0}

# Output_Start_Query
source: START -- {0} {1}
es: INICIO - {0} {1}

# Output_Testing_Server_Responses
source: Testing {0} server responses for google.com
de: Testing {0} Serverantworten für google.com
es: Pruebas {0} respuestas del servidor para google.com
