Repository: unfrl/dug
Catalog: cli/i18n/dug.*.resx
Languages: de, es

# Output_Testing_Server_Responses_Finished
source: Finished, got {0} good responses out of {1} requests
de: Fertig, bekam {0} gute Antworten aus {1} Anfragen
es: Terminados, obtuvo {0} buenas respuestas fuera de {1} solicitudes

# Output_Unhandled_Error
source: UNHANDLED ERROR -- {0} {1} -- {2}ms
de: Nicht behandelter Fehler - {0} {1} - {2} ms
es: No controlada ERROR - {0} {1} - {2} ms

# Output_Verbose_Enabled
source: Verbose Output Enabled
de: Ausführlich Ausgang Aktiviert
es: Verbosa salida habilitada

# Table_Argument
source: Argument
de: Streit
es: Argumento

# Table_Continent_Consensus
source: Consensus by Continent
de: Konsens von Kontinent
es: Consenso por Continente

# Table_Description
source: Description
de: Beschreibung
es: Descripción

# Table_Out_OF
source: out of
de: aus
es: fuera de

# Table_Overall
source: Overall
de: Insgesamt
es: General

# Table_Records_For
source: records for
de: Aufzeichnungen
es: registros para

# Table_Record_Type
source: Record Type
de: Aufnahmetyp
es: Tipo de registro

# Table_Reliability
source: Reliability
de: Verlässlichkeit
es: Fiabilidad

# Table_Results
source: Results
de: Ergebnisse
es: resultados

# Table_Server_Info
source: Server Info
es: Información del servidor

# Table_Value
source: Value
de: Wert
es: Valor

source: Unknown
de: Unbekannt
es: Desconocido

source: South America
de: Südamerika
es: Sudamerica

source: North America
de: Nordamerika
es: América del norte

source: Oceania
de: Ozeanien
es: Oceanía

source: Europe
de: Europa
es: Europa

source: Antarctica
de: Antarktis
es: Antártida

source: Africa
de: Afrika
es: África

# HT_Run_Watch
source: Run the query every X ms and render the results.
de: Führen Sie die Abfrage alle X ms aus und rendern Sie die Ergebnisse.
es: Ejecute la consulta cada X ms y muestre los resultados.

# ER_Run_Output_Format_Cannot_Be_Used_With_Watch
source: Cannot specify output-format (--output-format) and watch (-w, --watch)
de: Ausgabeformat (--output-format) und Watch (-w, --watch) kann nicht angegeben werden
es: No se puede especificar el formato de salida (--output-format) y el reloj (-w, --watch)

# ER_Run_Watch_Out_Of_Range
source: When specifying watch (-w, --watch) only positive values can be used
de: Bei der Angabe von Watch (-w, --watch) können nur positive Werte verwendet werden
es: Al especificar reloj (-w, --watch) solo se pueden usar valores positivos

# Output_Scan_Every
source: Scan every {0} ms. #: {1}
de: Scannen Sie alle {0} ms. #: {1}
es: Escanea cada {0} ms. #: {1}

# ER_Parallel_Out_Of_Range
source: (-p, --parallel) must be at least 1
de: (-p, --parallel) muss mindestens 1 . sein
es: (-p, --parallel) debe ser al menos 1

# ER_Retries_Out_Of_Range
source: (--retries) must be positive
es: (--retries) debe ser positivo

# ER_Timeout_Out_Of_Range
source: (-t, --timeout) must be positive
de: (-t, --timeout) muss positiv sein
es: (-t, --timeout) debe ser positiva

# ER_Server_Count_Out_Of_Range
source: (--server-count) must be at least 1
de: (--server-count) muss mindestens 1 sein
es: (--server-count) debe ser al menos 1

source: Asia
de: Asien
